HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxDma_regdef.h
/** \brief DMARAM Channel ${c} Destination Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_CH_DADR_Bits B;           /**< \brief Bitfield access */
} Ifx_DMA_CH_DADR;

/** \brief DMARAM Channel ${c} Read Data CRC Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_CH_RDCRCR_Bits B;         /**< \brief Bitfield access */
} Ifx_DMA_CH_RDCRCR;

/** \brief DMARAM Channel ${c} Source Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_CH_SADR_Bits B;           /**< \brief Bitfield access */
} Ifx_DMA_CH_SADR;

/** \brief DMARAM Channel ${c} Source and Destination Address CRC Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_CH_SDCRCR_Bits B;         /**< \brief Bitfield access */
} Ifx_DMA_CH_SDCRCR;

/** \brief DMARAM Channel ${c} Shadow Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_CH_SHADR_Bits B;          /**< \brief Bitfield access */
} Ifx_DMA_CH_SHADR;

/** \brief DMA Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_CLC_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_CLC;

/** \brief RP ${r} Error Interrupt Set Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ERRINTR_Bits B;           /**< \brief Bitfield access */
} Ifx_DMA_ERRINTR;

/** \brief DMA Channel ${c} Resource Partition Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_HRR_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_HRR;

/** \brief DMA Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ID_Bits B;                /**< \brief Bitfield access */
} Ifx_DMA_ID;

/** \brief ME ${m} Channel Address and Interrupt Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_ADICR_Bits B;          /**< \brief Bitfield access */
} Ifx_DMA_ME_ADICR;

/** \brief ME ${m} Channel Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_CHCR_Bits B;           /**< \brief Bitfield access */
} Ifx_DMA_ME_CHCR;

/** \brief ME ${m} Channel Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_CHSR_Bits B;           /**< \brief Bitfield access */
} Ifx_DMA_ME_CHSR;

/** \brief ME ${m} Clear Error Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_CLRE_Bits B;           /**< \brief Bitfield access */
} Ifx_DMA_ME_CLRE;

/** \brief ME ${m} Channel Destination Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_DADR_Bits B;           /**< \brief Bitfield access */
} Ifx_DMA_ME_DADR;

/** \brief ME ${m} Enable Error Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_EER_Bits B;            /**< \brief Bitfield access */
} Ifx_DMA_ME_EER;

/** \brief ME ${m} Error Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_ERRSR_Bits B;          /**< \brief Bitfield access */
} Ifx_DMA_ME_ERRSR;

/** \brief ME ${m} Read Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_R0_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_ME_R0;

/** \brief ME ${m} Read Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_R1_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_ME_R1;

/** \brief ME ${m} Read Register 2   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_R2_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_ME_R2;

/** \brief ME ${m} Read Register 3   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_R3_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_ME_R3;

/** \brief ME ${m} Read Register 4   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_R4_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_ME_R4;

/** \brief ME ${m} Read Register 5   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_DMA_ME_R5_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_ME_R5;

