HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxDma_regdef.h
/** \brief DMA object */
typedef volatile struct _Ifx_DMA
{
       Ifx_DMA_CLC                         CLC;                    /**< \brief 0, DMA Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_DMA_ID                          ID;                     /**< \brief 8, DMA Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[52];         /**< \brief C, \internal Reserved */
       Ifx_DMA_ACCEN                       ACCEN[4];               /**< \brief 40, RP ${r} Access Enable Register 1*/
       Ifx_UReg_8Bit                       reserved_60[192];       /**< \brief 60, \internal Reserved */
       Ifx_DMA_ME                          ME0;                    /**< \brief 120, */
       Ifx_UReg_8Bit                       reserved_1A0[3968];     /**< \brief 1A0, \internal Reserved */
       Ifx_DMA_ME                          ME1;                    /**< \brief 1120, */
       Ifx_UReg_8Bit                       reserved_11A0[96];      /**< \brief 11A0, \internal Reserved */
       Ifx_DMA_OTSS                        OTSS;                   /**< \brief 1200, DMA OCDS Trigger Set Select*/
       Ifx_UReg_8Bit                       reserved_1204[4];       /**< \brief 1204, \internal Reserved */
       Ifx_DMA_PRR0                        PRR0;                   /**< \brief 1208, DMA Pattern Read Register 0*/
       Ifx_DMA_PRR1                        PRR1;                   /**< \brief 120C, DMA Pattern Read Register 1*/
       Ifx_DMA_TIME                        TIME;                   /**< \brief 1210, DMA Time Register*/
       Ifx_UReg_8Bit                       reserved_1214[236];     /**< \brief 1214, \internal Reserved */
       Ifx_DMA_MODE                        MODE[4];                /**< \brief 1300, RP ${r} Mode Register*/
       Ifx_UReg_8Bit                       reserved_1310[16];      /**< \brief 1310, \internal Reserved */
       Ifx_DMA_ERRINTR                     ERRINTR[4];             /**< \brief 1320, RP ${r} Error Interrupt Set Register*/
       Ifx_UReg_8Bit                       reserved_1330[1232];    /**< \brief 1330, \internal Reserved */
       Ifx_DMA_HRR                         HRR[128];               /**< \brief 1800, DMA Channel ${c} Resource Partition Register*/
       Ifx_DMA_SUSENR                      SUSENR[128];            /**< \brief 1A00, DMA Channel ${c} Suspend Enable Register*/
       Ifx_DMA_SUSACR                      SUSACR[128];            /**< \brief 1C00, DMA Channel ${c} Suspend Acknowledge Register*/
       Ifx_DMA_TSR                         TSR[128];               /**< \brief 1E00, DMA Channel ${c} Transaction State Register*/
       Ifx_DMA_CH                          CH[128];                /**< \brief 2000, DMARAM Channel ${c} Control and Status Register*/
       Ifx_UReg_8Bit                       reserved_3000[4096];    /**< \brief 3000, \internal Reserved */
} Ifx_DMA;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXDMA_REGDEF_H */
